blog/vue.html
<!DOCTYPE html>
<html lang="zh">
<head>
<!-- 2022-02-08 Tue 22:00 -->
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>Vue.js</title>
<meta name="generator" content="Org mode">
<link rel="stylesheet" href="https://cdn.jsdelivr.net/gh/highlightjs/cdn-release@11.4.0/build/styles/base16/dracula.min.css">
<link rel="stylesheet" href="/theme/site.css"/>
</head>
<body>
<div id="content">
<header>
<h1 class="title">Vue.js</h1>
</header>
<div id="outline-container-orgcc59951" class="outline-2">
<h2 id="orgcc59951">Declarative Rendering 声明式呈现/渲染</h2>
<div class="outline-text-2" id="text-orgcc59951">
<p>
return data
</p>

<p>
insert function
</p>
</div>
</div>

<div id="outline-container-org88c987c" class="outline-2">
<h2 id="org88c987c">Handling User Input 处理用户输入</h2>
<div class="outline-text-2" id="text-org88c987c">
<p>
v-on:click
</p>

<p>
使用方法更新 App 的状态，而不需要直接操作 DOM，所有的 DOM 操作均由 Vue 完成。我们只需要关注底层逻辑。
</p>

<p>
<code>v-model</code> 让表单输入和应用状态之间的双向绑定变得轻而易举。
</p>
</div>
</div>

<div id="outline-container-org7d82b7b" class="outline-2">
<h2 id="org7d82b7b">Conditionals and Loops 条件和循环</h2>
<div class="outline-text-2" id="text-org7d82b7b">
<p>
v-if, v-for
</p>
</div>
</div>

<div id="outline-container-org2aa21dc" class="outline-2">
<h2 id="org2aa21dc">Composing with Components</h2>
<div class="outline-text-2" id="text-org2aa21dc">
<p>
组件系统
</p>
</div>
</div>

<div id="outline-container-org5e2e7cb" class="outline-2">
<h2 id="org5e2e7cb">Application &amp; Component Instances 应用和组件实例</h2>
<div class="outline-text-2" id="text-org5e2e7cb">
</div>
<div id="outline-container-orgfb8bd5f" class="outline-3">
<h3 id="orgfb8bd5f">Lifecycle Hooks</h3>
</div>

<div id="outline-container-org554d923" class="outline-3">
<h3 id="org554d923">Lifecycle Diagram</h3>
</div>
</div>

<div id="outline-container-orga7999dc" class="outline-2">
<h2 id="orga7999dc">Template Syntax</h2>
<div class="outline-text-2" id="text-orga7999dc">
<p>
<code>v-once</code> 怎么用
</p>

<p>
<code>v-bind</code> 用于属性
</p>
</div>

<div id="outline-container-org59b17d1" class="outline-3">
<h3 id="org59b17d1">Directives 指令</h3>
</div>

<div id="outline-container-orga0154e4" class="outline-3">
<h3 id="orga0154e4">Shorthands 速记</h3>
<div class="outline-text-3" id="text-orga0154e4">
</div>
<div id="outline-container-org808dc52" class="outline-4">
<h4 id="org808dc52">Caveats 警告</h4>
<div class="outline-text-4" id="text-org808dc52">
<ul class="org-ul">
<li>对动态参数值的约束：只能是除去 <code>null</code> （它的作用是明确移除当前绑定）的字符串，非字符串将显示警告</li>
<li>对动态参数表达式的约束</li>
</ul>
</div>
</div>
</div>
</div>

<div id="outline-container-org1f9a5be" class="outline-2">
<h2 id="org1f9a5be">Data Properties and Methods 数据属性和方法</h2>
<div class="outline-text-2" id="text-org1f9a5be">
</div>
<div id="outline-container-org978dcb1" class="outline-3">
<h3 id="org978dcb1">Methods</h3>
<div class="outline-text-3" id="text-org978dcb1">
<p>
定义方法的时候不要使用箭头函数，这会阻止 Vue 绑定正确的 <code>this</code> 值。
</p>
</div>

<div id="outline-container-org2a70098" class="outline-4">
<h4 id="org2a70098">Debouncing and Throttling</h4>
</div>
</div>
</div>

<div id="outline-container-org94e014a" class="outline-2">
<h2 id="org94e014a">Computed Properties and Watchers</h2>
<div class="outline-text-2" id="text-org94e014a">
</div>
<div id="outline-container-org5eb5502" class="outline-3">
<h3 id="org5eb5502">Computed Caching vs Methods</h3>
<div class="outline-text-3" id="text-org5eb5502">
<p>
前者变化的前提是：对应的数据改变。
</p>

<p>
如果数据不改变，就直接返回之前的内容，不需要再次运行函数。
</p>
</div>
</div>

<div id="outline-container-org49cbde3" class="outline-3">
<h3 id="org49cbde3">Computed Setter</h3>
</div>

<div id="outline-container-orga10be30" class="outline-3">
<h3 id="orga10be30">Watchers</h3>
</div>

<div id="outline-container-org793feea" class="outline-3">
<h3 id="org793feea">Computed vs Watch Property</h3>
</div>
</div>

<div id="outline-container-org1f9ecba" class="outline-2">
<h2 id="org1f9ecba">Class and Style Bindings</h2>
<div class="outline-text-2" id="text-org1f9ecba">
<p>
不能对
</p>

<div class="org-src-container">
<pre class="src src-html">&lt;<span style="color: #a9df90;">div</span> <span style="color: #aaca86;">id</span>=<span style="color: #ddbc91;">"app"</span>&gt;
&lt;/<span style="color: #a9df90;">div</span>&gt;
</pre>
</div>

<p>
进行 <code>:class</code> ， <code>:style</code> 操作
</p>
</div>
</div>

<div id="outline-container-org8eca82f" class="outline-2">
<h2 id="org8eca82f">Conditional Rendering</h2>
<div class="outline-text-2" id="text-org8eca82f">
</div>
<div id="outline-container-org1b83f0e" class="outline-3">
<h3 id="org1b83f0e"><code>v-if</code></h3>
</div>
<div id="outline-container-org29eff40" class="outline-3">
<h3 id="org29eff40"><code>v-show</code></h3>
</div>
<div id="outline-container-orgdb2fec0" class="outline-3">
<h3 id="orgdb2fec0"><code>v-for</code></h3>
</div>
</div>

<div id="outline-container-orge6aed7a" class="outline-2">
<h2 id="orge6aed7a">List Rendering</h2>
<div class="outline-text-2" id="text-orge6aed7a">
</div>
<div id="outline-container-org42e1abf" class="outline-3">
<h3 id="org42e1abf">Mapping an Array to Elements with <code>v-for</code></h3>
</div>
<div id="outline-container-org7941f95" class="outline-3">
<h3 id="org7941f95"><code>v-for</code> with an Object</h3>
</div>
<div id="outline-container-org554e18d" class="outline-3">
<h3 id="org554e18d">Maintaining State</h3>
<div class="outline-text-3" id="text-org554e18d">
<p>
就地补丁策略
</p>
</div>
</div>
<div id="outline-container-orgeb098bf" class="outline-3">
<h3 id="orgeb098bf">Array Change Detection</h3>
<div class="outline-text-3" id="text-orgeb098bf">
</div>
<div id="outline-container-orgfe3ee8f" class="outline-4">
<h4 id="orgfe3ee8f">Mutation Methods</h4>
</div>
<div id="outline-container-org7e0462f" class="outline-4">
<h4 id="org7e0462f">Replacing an Array</h4>
</div>
</div>
<div id="outline-container-org81251a4" class="outline-3">
<h3 id="org81251a4">Displaying Filtered/Sorted Results</h3>
</div>
</div>
</div>
</body>
</html>